results/test-100-report/statistics.json
{
  "OCR Upload" : {
    "transaction" : "OCR Upload",
    "sampleCount" : 100,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 1472.5900000000001,
    "medianResTime" : 1461.5,
    "minResTime" : 1080.0,
    "maxResTime" : 1850.0,
    "pct1ResTime" : 1761.6,
    "pct2ResTime" : 1817.5,
    "pct3ResTime" : 1850.0,
    "throughput" : 39.603960396039604,
    "receivedKBytesPerSec" : 26.995668316831683,
    "sentKBytesPerSec" : 3003.1396967821784
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 100,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 1472.5900000000001,
    "medianResTime" : 1461.5,
    "minResTime" : 1080.0,
    "maxResTime" : 1850.0,
    "pct1ResTime" : 1761.6,
    "pct2ResTime" : 1817.5,
    "pct3ResTime" : 1850.0,
    "throughput" : 39.603960396039604,
    "receivedKBytesPerSec" : 26.995668316831683,
    "sentKBytesPerSec" : 3003.1396967821784
  }
}